d1 = {}  # 创建空字典
d2 = {"a": 1, "b": 2, "c": 3}  # 创建带有初始数据的字典
d3 = dict([("a", 1), ("b", 2), ("c", 3)])  # 使用包裹元组的迭代对象进行创建
d4 = dict(zip(["a", "b", "c"], [1, 2, 3]))  # 使用zip函数关联两个列表
print(f"d1的结果为:{d1}")
print(f"d2的结果为:{d2}")
print(f"d3的结果为:{d3}")
print(f"d4的结果为:{d4}")
print("------------------")
s1 = set()  # 创建空集合
s2 = {1, 2, 3, 3, 4, 4, 4}  # 创建带有初始数据的集合,由于集合的不重复性,多个相同的值会被过滤,只保留1个
lis = [1, 2, 3, 3, 4, 4, 4]
s3 = set(lis)  # 通过列表等可迭代对象创建,同理,多个相同的值只保留一个
print(f"s1的结果为:{s1}")
print(f"s2的结果为:{s2}")
print(f"s3的结果为:{s3}")
